# -*- coding: utf-8 -*-
"""Game1.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1CZ-AuKDlWwe1-VzRRYATSn6HQ-MxGG_Q
"""



"""Задание 1. Создание игры."""

import numpy as np

number = np.random.randint(1, 101) # загадываем число
count = 0

while True:
    count += 1
    predict_number = int(input("Угадай число от 1 до 100"))

    n = 1    # добавляем колличество итераций
    for _ in range(n):   # добавляем цикл
        if predict_number > number:
            print("Число должно быть меньше!")

        elif predict_number < number:
            print("Число должно быть больше!")

        else:
            print(f"Вы угадали число! Это число = {number}, за {count} попыток")
            break # конец игры, выход из цикла